<!DOCTYPE html><html lang="zh-CN"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="author"><title>python-python basics · younguna</title><meta name="description" content="Python Basics
&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xC640; &amp;#xD29C;&amp;#xD50C;&amp;#xC758; &amp;#xB2E4;&amp;#xB978;&amp;#xC810;
&amp;#xB9AC;&amp;#xC2A4;&amp;#xD2B8;&amp;#xB294; mutable &amp;#xAC1D;&amp;#xC"><meta name="keywords"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="renderer" content="webkit"><link rel="short icon" href="/images/favicon.png" type="image/x-icon"><link rel="stylesheet" href="/css/style.css"><link rel="stylesheet" href="/css/blog_basic.css"><link rel="stylesheet" href="/css/font-awesome.min.css"><link rel="alternate" type="application/atom+xml" title="ATOM 1.0" href="/atom.xml"></head><body><div class="sidebar animated fadeInDown"><div class="logo-title"><div class="title"><img src="/images/logo@2x.png" style="width:127px;"><h3 title=""><a href="/">younguna</a></h3></div></div><ul class="social-links"></ul><div class="footer"><a target="_blank" href="/"><span>Theme by </span></a><a href="https://www.caicai.me"> CaiCai </a><span>&</span><a href="https://github.com/Ben02/hexo-theme-Anatole"> Ben</a><div class="by_farbox"><a href="https://hexo.io/zh-cn/" target="_blank">Proudly published with Hexo&#65281;</a></div></div></div><div class="main"><div class="page-top animated fadeInDown"><div class="nav"><li><a href="/">Home</a></li><li><a href="/archives">Archive</a></li></div><div class="information"><div class="back_btn"><li><a class="fa fa-chevron-left" onclick="window.history.go(-1)"> </a></li></div></div></div><div class="autopagerize_page_element"><div class="content"><div class="post-page"><div class="post animated fadeInDown"><div class="post-title"><h3><a>python-python basics</a></h3></div><div class="post-content"><h1 id="Python-Basics"><a href="#Python-Basics" class="headerlink" title="Python Basics"></a>Python Basics</h1><ol class="ui list">
<li>&#xB9AC;&#xC2A4;&#xD2B8;&#xC640; &#xD29C;&#xD50C;&#xC758; &#xB2E4;&#xB978;&#xC810;<ul>
<li>&#xB9AC;&#xC2A4;&#xD2B8;&#xB294; mutable &#xAC1D;&#xCCB4;&#xC774;&#xB2E4;.</li>
<li>&#xD29C;&#xD50C;&#xC740; immutable &#xAC1D;&#xCCB4;&#xC774;&#xB2E4;.</li>
<li>&#xB9AC;&#xC2A4;&#xD2B8;&#xBCF4;&#xB2E4; &#xD29C;&#xD50C;&#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xCC98;&#xB9AC;&#xD558;&#xB294; &#xAC83;&#xC774; &#xB354; &#xBE60;&#xB974;&#xB2E4;.</li>
</ul>
</li>
<li>&#xD30C;&#xC774;&#xC36C;&#xC758; &#xD575;&#xC2EC; &#xAE30;&#xB2A5;<ul>
<li>&#xC778;&#xD130;&#xD504;&#xB9AC;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC5B8;&#xC5B4;&#xC774;&#xB2E4;.</li>
<li>&#xBCC0;&#xC218;&#xB97C; &#xD560;&#xB2F9;&#xD560;&#xB54C; &#xD0C0;&#xC785;&#xC744; &#xC120;&#xC5B8;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC5C6;&#xB2E4;.</li>
<li>&#xAC1D;&#xCCB4;&#xC9C0;&#xD5A5;&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5D0; &#xC801;&#xC808;&#xD55C; &#xC5B8;&#xC5B4;&#xC774;&#xB2E4;.</li>
<li>&#xD568;&#xC218;&#xB294; &#xC77C;&#xAE09; &#xAC1D;&#xCCB4;&#xC774;&#xB2E4;. &#xC774;&#xB9D0;&#xC740; &#xD568;&#xC218;&#xB294; &#xBCC0;&#xC218;&#xC5D0; &#xD560;&#xB2F9;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB85C;&#xBD80;&#xD130; &#xBC18;&#xD658;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xACE0; &#xB2E4;&#xB978; &#xD568;&#xC218;&#xB85C; &#xC804;&#xB2EC;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;&#xB294; &#xAC83;&#xC774;&#xB2E4;.</li>
</ul>
</li>
<li>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC77C;&#xAE4C;&#xC694; &#xC2A4;&#xD06C;&#xB9BD;&#xD305; &#xC5B8;&#xC5B4;&#xC77C;&#xAE4C;&#xC694;?<ul>
<li>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xC2A4;&#xD06C;&#xB9BD;&#xD305;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB098; &#xC77C;&#xBC18;&#xC801;&#xC73C;&#xB85C; &#xB2E4;&#xBAA9;&#xC801; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5B8;&#xC5B4;&#xB85C; &#xC5EC;&#xACA8;&#xC9C4;&#xB2E4;.</li>
</ul>
</li>
<li><p>PEP8 &#xC774;&#xB780;?</p>
<ul>
<li>PEP&#xB294; Python Enhancement Proposal&#xC744; &#xC758;&#xBBF8;&#xD558;&#xBA70; &#xADF8; &#xC911; 8&#xBC88;&#xC9F8;&#xB85C; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC; &#xC2A4;&#xD0C0;&#xC77C;&#xC5D0; &#xB300;&#xD574; &#xC81C;&#xC548;&#xD558;&#xACE0; &#xC788;&#xB2E4;.</li>
</ul>
</li>
<li><p>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC5B4;&#xB5BB;&#xAC8C; &#xAD00;&#xB9AC;&#xB418;&#xB294;&#xAC00;?</p>
<ul>
<li>Memoery management in python is managed by <strong>Python Private Heap space</strong>. All Python objects and data structures are located in a private heap. The programmer does not have access to this private heap. The python interpreter takes care of this instead.</li>
<li>The allocation of heap space for Python objects is done by <strong>Python&#x2019;s memory manager</strong>. The core API gives access to some tools for the programmer to code.</li>
<li>Python also has an inbuilt garbage collector, which recycles all the unused memory and so that it can be made available to the heap space.</li>
</ul>
</li>
<li><p>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB780;?</p>
<ul>
<li>&#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB294; &#xC774;&#xB984;&#xC744; &#xC9D3;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC73C;&#xB85C;&#xC11C; &#xC774;&#xB984;&#xB4E4;&#xC774; &#xD56D;&#xC0C1; &#xC720;&#xB2C8;&#xD06C;&#xD558;&#xC5EC; &#xB124;&#xC774;&#xBC0D; &#xBB38;&#xC81C;&#xB97C; &#xD53C;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xD574;&#xC8FC;&#xB294; &#xC2DC;&#xC2A4;&#xD15C;&#xC774;&#xB2E4;.</li>
<li>&#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D; &#xC5B8;&#xC5B4;&#xC5D0;&#xC11C; &#xD2B9;&#xC815;&#xD55C; &#xAC1D;&#xCCB4;&#xB97C; &#xC774;&#xB984;&#xC5D0; &#xB530;&#xB77C; &#xAD6C;&#xBD84;&#xD560; &#xC218; &#xC788;&#xB294; &#xBC94;&#xC704;&#xB97C; &#xC758;&#xBBF8;&#xD55C;&#xB2E4;. &#xD30C;&#xC774;&#xC36C; &#xB0B4;&#xBD80;&#xC758; &#xBAA8;&#xB4E0; &#xAC83;&#xC740; &#xAC1D;&#xCCB4;&#xB85C; &#xAD6C;&#xC131;&#xB418;&#xBA70; &#xC774;&#xB4E4; &#xAC01;&#xAC01;&#xC740; &#xD2B9;&#xC815; &#xC774;&#xB984;&#xACFC;&#xC758; &#xB9E4;&#xD551; &#xAD00;&#xACC4;&#xB97C; &#xAC16;&#xAC8C; &#xB418;&#xB294;&#xB370; &#xC774; &#xB9E4;&#xD551;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xB294; &#xACF5;&#xAC04;&#xC744; &#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB77C;&#xACE0;&#xD55C;&#xB2E4;.</li>
<li>&#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xD544;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xB2E4;. &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC744; &#xC218;&#xD589;&#xD558;&#xB2E4;&#xBCF4;&#xBA74; &#xBAA8;&#xB4E0; &#xBCC0;&#xC218; &#xC774;&#xB984;&#xACFC; &#xD568;&#xC218; &#xC774;&#xB984;&#xC744; &#xC815;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC911;&#xC694;&#xD55C;&#xB370; &#xC774;&#xB4E4; &#xBAA8;&#xB450;&#xB97C; &#xACB9;&#xCE58;&#xC9C0; &#xC54A;&#xAC8C; &#xC815;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC0AC;&#xC2E4;&#xC0C1; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xD504;&#xB85C;&#xADF8;&#xB798;&#xBC0D;&#xC5B8;&#xC5B4;&#xC5D0;&#xC11C;&#xB294; &#xB124;&#xC784; &#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB77C;&#xB294; &#xAC1C;&#xB150;&#xC744; &#xB3C4;&#xC785;&#xD558;&#xC5EC;, &#xD2B9;&#xC815;&#xD55C; &#xD558;&#xB098;&#xC758; &#xC774;&#xB984;&#xC774; &#xD1B5;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB294; &#xBC94;&#xC704;&#xB97C; &#xC81C;&#xD55C;&#xD55C;&#xB2E4;. &#xC989; &#xC18C;&#xC18D;&#xB41C; &#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xAC00; &#xB2E4;&#xB974;&#xB2E4;&#xBA74; &#xAC19;&#xC740; &#xC774;&#xB984;&#xC774; &#xB2E4;&#xB978; &#xAC1D;&#xCCB4;&#xB97C; &#xAC00;&#xB974;&#xD0A4;&#xB3C4;&#xB85D; &#xD558;&#xB294; &#xAC83;&#xC774; &#xAC00;&#xB2A5;&#xD574;&#xC9C4;&#xB2E4;.</li>
<li>&#xD30C;&#xC774;&#xC36C;&#xC758; &#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB294; 3&#xAC00;&#xC9C0;&#xB85C; &#xBD84;&#xB958;&#xD560; &#xC218; &#xC788;&#xB2E4;.<ul>
<li>Built-in Namespace: &#xAE30;&#xBCF8; &#xB0B4;&#xC7A5; &#xD568;&#xC218; &#xBC0F; &#xAE30;&#xBCF8; &#xC608;&#xC678;&#xB4E4;&#xC758; &#xC774;&#xB984;&#xB4E4;&#xC774; &#xC18C;&#xC18D;&#xB41C;&#xB2E4;. &#xD30C;&#xC774;&#xC36C;&#xC73C;&#xB85C; &#xC791;&#xC131;&#xB41C; &#xBAA8;&#xB4E0; &#xCF54;&#xB4DC; &#xBC94;&#xC704;&#xAC00; &#xD3EC;&#xD568;&#xB41C;&#xB2E4;.</li>
<li>Module: Global Namespace: &#xBAA8;&#xB4C8;&#xBCC4;&#xB85C; &#xC874;&#xC7AC;&#xD558;&#xBA70;, &#xBAA8;&#xB4C8; &#xC804;&#xCCB4;&#xC5D0;&#xC11C; &#xD1B5;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB294; &#xC774;&#xB984;&#xB4E4;&#xC774; &#xC18C;&#xC18D;&#xB41C;&#xB2E4;.</li>
<li>Function: Local Namespace: &#xD568;&#xC218; &#xBC0F; &#xBA54;&#xC11C;&#xB4DC; &#xBCC4;&#xB85C; &#xC874;&#xC7AC;&#xD558;&#xBA70;, &#xD568;&#xC218; &#xB0B4;&#xC758; &#xC9C0;&#xC5ED; &#xBCC0;&#xC218;&#xB4E4;&#xC758; &#xC774;&#xB984;&#xC774; &#xC18C;&#xC18D;&#xB41C;&#xB2E4;.</li>
</ul>
</li>
</ul>
</li>
<li>PYTHONPATH?</li>
</ol>
<ul class="ui list">
<li>&#xBAA8;&#xB4C8;&#xC774; &#xC784;&#xD3EC;&#xD2B8; &#xB420;&#xB54C; &#xD574;&#xB2F9; &#xBAA8;&#xB4C8;&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xCC3E;&#xC544;&#xBCF4;&#xB294; &#xB514;&#xB809;&#xD1A0;&#xB9AC;&#xB4E4;&#xC758; &#xC9D1;&#xD569;&#xC774;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>&#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC774;&#xB780; &#xBB34;&#xC5C7;&#xC778;&#xAC00;? &#xC790;&#xC8FC; &#xC4F0;&#xC774;&#xB294; &#xBE4C;&#xD2B8;&#xC778; &#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC740; &#xBB34;&#xC5C7;&#xC774; &#xC788;&#xB294;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>&#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC740; &#xD30C;&#xC774;&#xC36C; &#xCF54;&#xB4DC;&#xB97C; &#xD3EC;&#xD568;&#xD558;&#xACE0; &#xC788;&#xB294; &#xD30C;&#xC77C;&#xB4E4;&#xC744; &#xC77C;&#xCEEB;&#xB294;&#xB2E4;. &#xC774; &#xCF54;&#xB4DC;&#xB4E4;&#xC740; &#xD568;&#xC218;, &#xD074;&#xB798;&#xC2A4;, &#xBCC0;&#xC218;&#xB4E4;&#xC744; &#xD3EC;&#xD568;&#xD55C;&#xB2E4;. &#xD30C;&#xC774;&#xC36C; &#xBAA8;&#xB4C8;&#xC740; .py&#xB85C; &#xB05D;&#xB09C;&#xB2E4;.</li>
<li>os, sys, math, random, datetime, json</li>
</ul>
<ol class="ui list">
<li>&#xC9C0;&#xC5ED;&#xBCC0;&#xC218;&#xC640; &#xC804;&#xC5ED;&#xBCC0;&#xC218;&#xB294; &#xBB34;&#xC5C7;&#xC778;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>&#xC804;&#xC5ED; &#xACF5;&#xAC04;&#xC774;&#xB098; &#xD568;&#xC218; &#xBC16;&#xC5D0; &#xC120;&#xC5B8;&#xB41C; &#xBCC0;&#xC218;&#xB4E4;&#xC744; &#xC804;&#xC5ED;&#xBCC0;&#xC218;&#xB77C;&#xACE0; &#xC77C;&#xCEEB;&#xB294;&#xB2E4;. &#xC774; &#xBCC0;&#xC218;&#xB4E4;&#xC740; &#xBAA8;&#xB4E0; &#xD568;&#xC218;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;.</li>
<li>&#xD568;&#xC218;&#xB0B4;&#xC5D0; &#xC120;&#xC5B8;&#xB41C; &#xBAA8;&#xB4E0; &#xBCC0;&#xC218;&#xB4E4;&#xC744; &#xC9C0;&#xC5ED; &#xBCC0;&#xC218;&#xB77C;&#xACE0; &#xC77C;&#xCEEB;&#xB294;&#xB2E4;. &#xC804;&#xC5ED; &#xACF5;&#xAC04;&#xC5D0;&#xC11C; &#xC811;&#xADFC;&#xC774; &#xBD88;&#xAC00;&#xD558;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>&#xD30C;&#xC774;&#xC36C;&#xC740; case sensitive &#xD55C;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>&#xADF8;&#xB807;&#xB2E4; &#xD30C;&#xC774;&#xC36C;&#xC740; &#xB300;&#xBB38;&#xC790;&#xC640; &#xC18C;&#xBB38;&#xC790;&#xB97C; &#xBAA8;&#xB450; &#xB530;&#xC9C4;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>indentation&#xC740; &#xD544;&#xC218;&#xC778;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; &#xB4E4;&#xC5EC;&#xC4F0;&#xAE30;&#xB294; &#xD544;&#xC218;&#xC774;&#xB2E4;. &#xCF54;&#xB4DC; &#xBE14;&#xB85D;&#xC744; &#xAD6C;&#xBD84;&#xD558;&#xB294;&#xB370; &#xC0AC;&#xC6A9;&#xB418;&#xBA70; &#xB8E8;&#xD504;, &#xD074;&#xB798;&#xC2A4;, &#xD568;&#xC218; &#xB4F1;&#xC744; &#xAD6C;&#xBD84;&#xD55C;&#xB2E4;. &#xC8FC;&#xB85C; &#xB124;&#xAC1C;&#xC758; &#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB85C; &#xAD6C;&#xBD84;&#xD55C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Python array&#xC640; list&#xC758; &#xCC28;&#xC774;&#xC810;&#xC740; &#xBB34;&#xC5C7;&#xC778;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>array&#xB294; &#xD55C;&#xAC00;&#xC9C0; &#xD0C0;&#xC785;&#xC758; &#xB370;&#xC774;&#xD130;&#xB9CC; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xB294; &#xCC28;&#xC774;&#xAC00; &#xC788;&#xC73C;&#xBA70; array&#xAC00; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC801;&#xAC8C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC774;&#xB4DD;&#xC774; &#xC788;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>What is a lambda function?</li>
</ol>
<ul class="ui list">
<li>&#xC775;&#xBA85;&#xD568;&#xC218;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xBA70; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xB97C; &#xC5BC;&#xB9C8;&#xB4E0;&#xC9C0; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xC9C0;&#xB9CC; &#xD55C;&#xC904;&#xB85C;&#xB9CC; &#xC791;&#xC131;&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>&#xD30C;&#xC774;&#xC36C;&#xC5D0;&#xC11C; self&#xB780;?</li>
</ol>
<ul class="ui list">
<li>self&#xB294; &#xD074;&#xB798;&#xC2A4;&#xC5D0;&#xC11C; &#xC778;&#xC2A4;&#xD134;&#xC2A4;&#xB098; &#xAC1D;&#xCCB4; &#xC790;&#xC2E0;&#xC744; &#xC758;&#xBBF8;&#xD55C;&#xB2E4;. &#xD074;&#xB798;&#xC2A4;&#xC758; &#xBAA8;&#xB4E0; &#xBA54;&#xC18C;&#xB4DC;&#xC5D0;&#xC11C; &#xC5B8;&#xC81C;&#xB098; &#xC81C;&#xC77C; &#xCCAB;&#xBC88;&#xC9F8; &#xB9E4;&#xAC1C;&#xBCC0;&#xC218;&#xC774;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>break, continue, pass?</li>
</ol>
<ul class="ui list">
<li>BREAK: &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB420; &#xC2DC; &#xB8E8;&#xD504;&#xB97C; &#xC774;&#xD0C8;&#xD558;&#xC5EC; &#xB2E4;&#xC74C; &#xCF54;&#xB4DC;&#xB97C; &#xC2E4;&#xD589;&#xD558;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</li>
<li>Continue: &#xD2B9;&#xC815; &#xC870;&#xAC74;&#xC774; &#xCDA9;&#xC871;&#xB420; &#xC2DC; &#xD55C;&#xBC88;&#xC758; &#xB8E8;&#xD504;&#xB97C; &#xC0DD;&#xB7B5;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</li>
<li>Pass: &#xC544;&#xBB34;&#xAC83;&#xB3C4; &#xD558;&#xC9C0; &#xC54A;&#xACE0; &#xB118;&#xAE38; &#xC218; &#xC788;&#xB3C4;&#xB85D;&#xD55C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li><code>[::-1]</code>&#xB294; &#xBB34;&#xC5C7;&#xC744; &#xC218;&#xD589;&#xD558;&#xB294;&#xAC00;?</li>
</ol>
<ul class="ui list">
<li>array&#xB098; list&#xB97C; &#xAC70;&#xAFB8;&#xB85C; &#xB4A4;&#xC9D1;&#xC5B4; &#xB9AC;&#xD134;&#xD55C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Python iterator?</li>
</ol>
<ul class="ui list">
<li>Iterable<ul>
<li>iterable &#xAC1D;&#xCCB4; - &#xBC18;&#xBCF5; &#xAC00;&#xB2A5;&#xD55C; &#xAC1D;&#xCCB4;</li>
<li>&#xB300;&#xD45C;&#xC801;&#xC73C;&#xB85C; iterable&#xD55C; &#xD0C0;&#xC785;: list, dict, set, str, bytes, tuple, range</li>
<li><code>isinstance(target, collections.Iterable)</code>&#xB85C; &#xD655;&#xC778; &#xAC00;&#xB2A5;</li>
</ul>
</li>
<li>Iterator<ul>
<li>iterator &#xAC1D;&#xCCB4; - &#xAC12;&#xC744; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xAEBC;&#xB0BC; &#xC218; &#xC788;&#xB294; &#xAC1D;&#xCCB4;</li>
<li>iterator&#xB294; iterable&#xD55C; &#xAC1D;&#xCCB4;&#xB97C; &#xB0B4;&#xC7A5;&#xD568;&#xC218; &#xB610;&#xB294; iterable&#xAC1D;&#xCCB4;&#xC758; &#xBA54;&#xC18C;&#xB4DC;&#xB85C; &#xAC1D;&#xCCB4;&#xB97C; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
<li>&#xD30C;&#xC774;&#xC36C; &#xB0B4;&#xC7A5;&#xD568;&#xC218; <code>iter()</code>&#xB97C; &#xC0AC;&#xC6A9;&#xD574; iterator &#xAC1D;&#xCCB4;&#xB97C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</li>
</ul>
</li>
</ul>
<figure class="highlight python"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br></pre></td><td class="code"><pre><span class="line">a = [<span class="number">1</span>,<span class="number">2</span>,<span class="number">3</span>]</span><br><span class="line">a_iter = iter(a)</span><br><span class="line">type(a_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span>&lt;<span class="class"><span class="keyword">class</span> &apos;<span class="title">list_iterator</span>&apos;&gt;</span></span><br><span class="line"><span class="class"></span></span><br><span class="line"><span class="class"># <span class="title">iterable</span>&#xAC1D;&#xCCB4;&#xB294; &#xB9E4;&#xC9C1;&#xBA54;&#xC18C;&#xB4DC; <span class="title">__iter__</span> &#xBA54;&#xC18C;&#xB4DC;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xBA54;&#xC18C;&#xB4DC;&#xB85C; <span class="title">iterator</span>&#xB97C; &#xB9CC;&#xB4E4;&#xC5B4; &#xBCF4;&#xACA0;&#xC2B5;&#xB2C8;&#xB2E4;.</span></span><br><span class="line">b = {1,2,3}</span><br><span class="line">type(b)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span>&lt;<span class="class"><span class="keyword">class</span> &apos;<span class="title">set</span>&apos;&gt;</span></span><br><span class="line">b_iter = b.__iter__()</span><br><span class="line">type(b_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span>&lt;<span class="class"><span class="keyword">class</span> &apos;<span class="title">set_iterator</span>&apos;&gt;</span></span><br><span class="line"><span class="class"># <span class="title">iterator</span>&#xB294; &#xAC12;&#xC744; &#xCC28;&#xB840;&#xB300;&#xB85C; &#xAEBC;&#xB0BC; &#xC218; &#xC788;&#xB294; &#xAC1D;&#xCCB4;&#xC785;&#xB2C8;&#xB2E4;.</span></span><br><span class="line"># next &#xB0B4;&#xC7A5; &#xD568;&#xC218;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xB54C; &#xB9C8;&#xB2E4; &#xCCAB;&#xBC88;&#xC9F8;, &#xB450;&#xBC88;&#xC9F8;, &#xC138;&#xBC88;&#xC9F8; &#xAC12;&#xC774; &#xCD9C;&#xB825;&#xB429;&#xB2C8;&#xB2E4;.</span><br><span class="line"><span class="comment"># &#xB124;&#xBC88;&#xC9F8; &#xC2E4;&#xD589;&#xC5D0;&#xC11C;&#xB294; StopIteration &#xC774;&#xB77C;&#xB294; &#xC608;&#xC678;&#xAC00; &#xBC1C;&#xC0DD;&#xD569;&#xB2C8;&#xB2E4;.</span></span><br><span class="line"></span><br><span class="line">next(a_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">1</span></span><br><span class="line">next(a_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">2</span></span><br><span class="line">next(a_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">3</span></span><br><span class="line">next(a_iter)</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span>Traceback (most recent call last):</span><br><span class="line">	File <span class="string">&quot;&lt;stdin&gt;&quot;</span>, line <span class="number">1</span>, <span class="keyword">in</span> &lt;module&gt;</span><br><span class="line">StopIteration</span><br><span class="line"><span class="comment"># iterator &#xB9E4;&#xC9C1; &#xBA54;&#xC18C;&#xB4DC; &apos;next&apos;&#xB97C; &#xD1B5;&#xD574; &#xD558;&#xB098;&#xC529; &#xAC12;&#xC744; &#xAEBC;&#xB0B4;&#xBD05;&#xB2C8;&#xB2E4;.</span></span><br><span class="line">b_iter.__next__()</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">1</span></span><br><span class="line">b_iter.__next__()</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">2</span></span><br><span class="line">b_iter.__next__()</span><br><span class="line"><span class="meta">&gt;&gt;&gt; </span><span class="number">3</span></span><br></pre></td></tr></table></figure>
<ol class="ui list">
<li>Python Generator</li>
</ol>
<ul class="ui list">
<li>Functions that return an iterable set of items are called generators.</li>
<li>&#xC81C;&#xB124;&#xB808;&#xC774;&#xD130;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; iterator&#xB97C; &#xBC1B;&#xC544; &#xAE34; &#xBC30;&#xC5F4;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xCC98;&#xB9AC;&#xD558;&#xBA74; &#xBA54;&#xBAA8;&#xB9AC;&#xC640; &#xC2DC;&#xAC04;&#xC801;&#xC73C;&#xB85C; &#xAD49;&#xC7A5;&#xD55C; &#xD6A8;&#xC728;&#xC744; &#xAC00;&#xC9C8; &#xC218; &#xC788;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>is, not, in operator</li>
</ol>
<ul class="ui list">
<li>operator&#xB294; &#xD2B9;&#xBCC4;&#xD55C; &#xD568;&#xC218;&#xC774;&#xB2E4;. &#xD55C; &#xAC1C;&#xB098; &#xD55C; &#xAC1C; &#xC774;&#xC0C1;&#xC758; &#xAC12;&#xC744; &#xAC00;&#xC9C0;&#xACE0; &#xACB0;&#xACFC;&#xB97C; &#xB0B8;&#xB2E4;.</li>
<li>is&#xB294; &#xBA54;&#xBAA8;&#xB9AC; &#xC704;&#xCE58;&#xB97C; &#xBE44;&#xAD50;&#xD55C;&#xB2E4;.</li>
<li>not&#xC740; boolean&#xAC12;&#xC744; &#xB4A4;&#xC9D1;&#xB294;&#xB2E4;.</li>
<li>in&#xC740; &#xC5B4;&#xB5A4; &#xAC12;&#xC774; &#xD574;&#xB2F9; &#xBC30;&#xC5F4;&#xC5D0; &#xC874;&#xC7AC;&#xD558;&#xB294;&#xC9C0; &#xD655;&#xC778;&#xD55C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Python&#xC774; &#xB05D;&#xB098;&#xBA74; &#xC65C; &#xBA54;&#xBAA8;&#xB9AC; &#xD560;&#xB2F9;&#xC744; &#xB05D;&#xB0B4;&#xC9C0; &#xC54A;&#xC744;&#xAE4C;?</li>
</ol>
<ul class="ui list">
<li>Whenever Python exits, especially those Python modules which are having circular references to other objects or the objects that are referenced from the global namespaces are not always de-allocated or freed.</li>
<li>It is impossible to de-allocate those portions of memory that are reserved by the C library.</li>
<li>On exit, because of having its own efficient clean up mechanism, Python would try to de-allocate/destroy every other object.</li>
<li>&#xC21C;&#xD658;&#xCC38;&#xC870;&#xB97C; &#xB098;&#xC911;&#xC5D0; &#xCC3E;&#xC544;&#xB0B4;&#xC11C; &#xD574;&#xC81C;&#xD55C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Python &#xD328;&#xD0A4;&#xC9C0;</li>
</ol>
<ul class="ui list">
<li>&#xB2E4;&#xC218;&#xC758; &#xBAA8;&#xB4C8;&#xC744; &#xD3EC;&#xD568;&#xD558;&#xB294; &#xB124;&#xC784;&#xC2A4;&#xD398;&#xC774;&#xC2A4;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Numpy array VS Python list</li>
</ol>
<ul class="ui list">
<li>list&#xB294; vectorized operation&#xC774; &#xBD88;&#xAC00;&#xB2A5;&#xD558;&#xBA70; &#xC6D0;&#xC18C; &#xD558;&#xB098;&#xD558;&#xB098;&#xC5D0; &#xCC98;&#xB9AC;&#xB97C; &#xD574;&#xC92D;&#xC57C; &#xD55C;&#xB2E4;.</li>
<li>Numpy&#xB294; vectorized operation&#xC774; &#xAC00;&#xB2A5;&#xD558;&#xBA70; &#xD6E8;&#xC52C; &#xD6A8;&#xC728;&#xC801;&#xC774;&#xBA70; &#xD3B8;&#xB9AC;&#xD558;&#xB2E4;. </li>
</ul>
<ol class="ui list">
<li>deepcopy VS shallowcopy</li>
</ol>
<ul class="ui list">
<li>&#xB9AC;&#xC2A4;&#xD2B8; &#xC2AC;&#xB77C;&#xC774;&#xC2F1;&#xACFC; copy &#xBAA8;&#xB4C8;&#xC758; copy &#xB294; shallow copy&#xC774;&#xB2E4;.<ul>
<li>a &#xB9AC;&#xC2A4;&#xD2B8;&#xB97C; &#xBCF5;&#xC0AC;&#xD558;&#xC5EC; b &#xBCC0;&#xC218;&#xC5D0; &#xD560;&#xB2F9;&#xD558;&#xBA74; &#xB458;&#xC740; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; &#xAC00;&#xC9C0;&#xACE0; &#xC788;&#xC9C0;&#xB9CC; &#xB9CC;&#xC57D; &#xB9AC;&#xC2A4;&#xD2B8;&#xC758; &#xC778;&#xB371;&#xC2A4; 0 &#xC548;&#xC5D0; mutable&#xAC1D;&#xCCB4;&#xAC00; &#xD560;&#xB2F9;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xACBD;&#xC6B0; <code>id(a[0]) == id(b[0])</code>&#xC758; &#xACBD;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD574; &#xBC84;&#xB9B0;&#xB2E4;. a[0]&#xC758; &#xAC12;&#xC744; &#xBCC0;&#xACBD;&#xD558;&#xBA74; b[0]&#xC758; &#xAC12; &#xB610;&#xD55C; &#xBCC0;&#xACBD;&#xB41C;&#xB2E4;.</li>
</ul>
</li>
<li>copy &#xBAA8;&#xB4C8;&#xC758; deepcopy&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74; &#xC704;&#xB97C; &#xBC29;&#xC9C0;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xB0B4;&#xBD80; &#xAC1D;&#xCCB4;&#xB4E4; &#xAE4C;&#xC9C0; &#xBAA8;&#xB450; &#xC0C8;&#xB86D;&#xAC8C; copy&#xB418;&#xC5B4; &#xB2E4;&#xB978; &#xBA54;&#xBAA8;&#xB9AC; &#xC8FC;&#xC18C;&#xB97C; &#xAC00;&#xC9C0;&#xAC8C; &#xB41C;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Multithreading in Python?</li>
</ol>
<ul class="ui list">
<li>&#xD30C;&#xC774;&#xC36C;&#xC740; &#xBA40;&#xD2F0;&#xC4F0;&#xB808;&#xB529; &#xD328;&#xD0A4;&#xC9C0;&#xAC00; &#xC874;&#xC7AC;&#xD558;&#xC9C0;&#xB9CC; &#xC18D;&#xB3C4;&#xB97C; &#xD5A5;&#xC0C1;&#xC2DC;&#xD0A4;&#xAE30; &#xC704;&#xD574; &#xBA40;&#xD2F0;&#xC4F0;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xAC83;&#xC740; &#xC88B;&#xC740; &#xC544;&#xC774;&#xB514;&#xAC00; &#xC544;&#xB2C8;&#xB2E4;.</li>
<li>&#xD30C;&#xC774;&#xC36C;&#xC740; Global Interpreter Lock(GIL)&#xC744; </li>
<li>GIL&#xC774; &#xC874;&#xC7AC;&#xD558;&#xB294; &#xC774;&#xC720;: CPython&#xC5D0;&#xC11C;&#xC758; GIL&#xC740; Python&#xC744; &#xC2E4;&#xD589;&#xD560; &#xB54C; &#xC5EC;&#xB7EC; &#xC4F0;&#xB808;&#xB4DC;&#xB97C; &#xC0AC;&#xC6A9;&#xD560; &#xACBD;&#xC6B0;, &#xB2E8; &#xD558;&#xB098;&#xC758; &#xC4F0;&#xB808;&#xB4DC;&#xB9CC;&#xC774; Python Object&#xC5D0; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xC81C;&#xD55C;&#xD558;&#xB294; mutex&#xC774;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774; Lock&#xC774; &#xD544;&#xC694;&#xD55C; &#xC774;&#xC720;&#xB294; CPython&#xC774; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xAD00;&#xB9AC;&#xD558;&#xB294; &#xBC29;&#xBC95;&#xC774; thread-safe&#xD558;&#xC9C0; &#xC54A;&#xAE30; &#xB54C;&#xBB38;&#xC774;&#xB2E4;.</li>
<li>thread-safe&#xD558;&#xC9C0; &#xC54A;&#xB2E4;&#xB294; &#xC758;&#xBBF8;&#xC758; &#xC608;)<ul>
<li>&#xD558;&#xB098;&#xC758; &#xC804;&#xC5ED; &#xBCC0;&#xC218; x&#xC5D0; &#xB450; &#xAC1C;&#xC758; &#xC4F0;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC2DC;&#xC5D0; &#xC811;&#xADFC;&#xD574;&#xC11C; &#xAC01;&#xC790;&#xC758; &#xC791;&#xC5C5;&#xC744; &#xD558;&#xBA74; &#xC5B4;&#xB290; &#xD55C;&#xCABD;&#xC758; &#xC791;&#xC5C5; &#xACB0;&#xACFC;&#xAC00; &#xC539;&#xD788;&#xB294; &#xACBD;&#xC6B0;&#xAC00; &#xBC1C;&#xC0DD;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC5EC;&#xB7EC; &#xC4F0;&#xB808;&#xB4DC;&#xAC00; &#xACF5;&#xC720;&#xB41C; &#xB370;&#xC774;&#xD130;&#xB97C; &#xBCC0;&#xACBD;&#xD568;&#xC73C;&#xB85C;&#xC368; &#xBC1C;&#xC0DD;&#xD558;&#xB294; &#xBB38;&#xC81C;&#xB97C; race condition&#xC774;&#xB77C;&#xACE0; &#xBD80;&#xB978;&#xB2E4;.</li>
</ul>
</li>
<li>mutex (mutual exclusion)&#xC740; &#xACF5;&#xC720;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC758; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC5EC;&#xB7EC; &#xC4F0;&#xB808;&#xB4DC;&#xAC00; &#xB3D9;&#xC2DC;&#xC5D0; &#xC0AC;&#xC6A9;&#xD560; &#xC218; &#xC5C6;&#xB3C4;&#xB85D; &#xC7A0;&#xADF8;&#xB294; &#xC77C;&#xC744; mutex&#xAC00; &#xB9E1;&#xB294;&#xB2E4;.</li>
</ul>
<h4 id="&#xC4F0;&#xB808;&#xB4DC;&#xC640;-&#xD504;&#xB85C;&#xC138;&#xC2A4;"><a href="#&#xC4F0;&#xB808;&#xB4DC;&#xC640;-&#xD504;&#xB85C;&#xC138;&#xC2A4;" class="headerlink" title="&#xC4F0;&#xB808;&#xB4DC;&#xC640; &#xD504;&#xB85C;&#xC138;&#xC2A4;"></a>&#xC4F0;&#xB808;&#xB4DC;&#xC640; &#xD504;&#xB85C;&#xC138;&#xC2A4;</h4><ul class="ui list">
<li>&#xC6B4;&#xC601;&#xCCB4;&#xC81C;&#xAC00; &#xC0DD;&#xC131;&#xD558;&#xB294; &#xC791;&#xC5C5; &#xB2E8;&#xC704;&#xB97C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#xC774; &#xD504;&#xB85C;&#xC138;&#xC2A4; &#xC548;&#xC5D0;&#xC11C; &#xACF5;&#xC720;&#xB418;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xB97C; &#xBC14;&#xD0D5;&#xC73C;&#xB85C; &#xC5EC;&#xB7EC; &#xC791;&#xC5C5;&#xC744; &#xB610; &#xC0DD;&#xC131;&#xD560; &#xC218; &#xC788;&#xB294;&#xB370;, &#xC774; &#xB54C;&#xC758; &#xC791;&#xC5C5; &#xB2E8;&#xC704;&#xB97C; &#xC4F0;&#xB808;&#xB4DC;&#xB77C;&#xACE0; &#xD55C;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xAC01; &#xC4F0;&#xB808;&#xB4DC; &#xB9C8;&#xB2E4; &#xD560;&#xB2F9;&#xB41C; &#xAC1C;&#xC778;&#xC801;&#xC778; &#xBA54;&#xBAA8;&#xB9AC;&#xAC00; &#xC788;&#xC73C;&#xBA74;&#xC11C;, &#xC4F0;&#xB808;&#xB4DC;&#xAC00; &#xC18D;&#xD55C; &#xD504;&#xB85C;&#xC138;&#xC2A4;&#xAC00; &#xAC00;&#xC9C0;&#xB294; &#xBA54;&#xBAA8;&#xB9AC;&#xC5D0;&#xB3C4; &#xC811;&#xADFC;&#xD560; &#xC218; &#xC788;&#xB2E4;.</li>
</ul>
<ol class="ui list">
<li>Python Inheritance</li>
</ol>
<ul class="ui list">
<li>reserved for later commit.</li>
</ul>
<ol class="ui list">
<li>Polymorphism</li>
</ol>
<ul class="ui list">
<li>&#xC790;&#xB140;&#xD074;&#xB798;&#xC2A4;&#xB294; &#xBD80;&#xBAA8;&#xD074;&#xB798;&#xC2A4;&#xC758; &#xBA54;&#xC11C;&#xB4DC; &#xC911; &#xB611;&#xAC19;&#xC740; &#xC774;&#xB984;&#xC758; &#xBA54;&#xC11C;&#xB4DC;&#xB97C; &#xC120;&#xC5B8;&#xD560; &#xC218; &#xC788;&#xB2E4;. &#xC774;&#xAC83;&#xC774; &#xB2E4;&#xD615;&#xC131;(Polymorphism)&#xC744; &#xC758;&#xBBF8;&#xD55C;&#xB2E4;.</li>
</ul>
</div><div class="post-footer"><div class="meta"><div class="info"><i class="fa fa-sun-o"></i><span class="date">2019-06-27</span><i class="fa fa-tag"></i><a class="tag" href="/tags/파이썬/" title="파이썬">파이썬 </a><a class="tag" href="/tags/python/" title="python">python </a></div></div></div></div><div class="pagination"><ul class="clearfix"><li class="pre pagbuttons"><a class="btn" role="navigation" href="/2019/06/28/Algorithm-Spicier/" title="Algorithm-Spicier">Previous Post</a></li><li class="next pagbuttons"><a class="btn" role="navigation" href="/2019/04/25/Algoritm-Collatz/" title="Algoritm - Collatz">Next Post</a></li></ul></div></div></div></div></div><script src="/js/jquery.js"></script><script src="/js/jquery-migrate-1.2.1.min.js"></script><script src="/js/jquery.appear.js"></script></body></html>