<!DOCTYPE html><html lang="zh-CN"><head><meta charset="utf-8"><meta name="X-UA-Compatible" content="IE=edge"><meta name="author"><title>브라우저 뒤에서 일어나는 일 · younguna</title><meta name="description" content="&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800; &amp;#xB4A4;&amp;#xC5D0;&amp;#xC11C; &amp;#xC77C;&amp;#xC5B4;&amp;#xB098;&amp;#xB294; &amp;#xC77C;

&amp;#xBE0C;&amp;#xB77C;&amp;#xC6B0;&amp;#xC800;
URL&amp;#xC5D0; &amp;#xC"><meta name="keywords"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="renderer" content="webkit"><link rel="short icon" href="/images/favicon.png" type="image/x-icon"><link rel="stylesheet" href="/css/style.css"><link rel="stylesheet" href="/css/blog_basic.css"><link rel="stylesheet" href="/css/font-awesome.min.css"><link rel="alternate" type="application/atom+xml" title="ATOM 1.0" href="/atom.xml"></head><body><div class="sidebar animated fadeInDown"><div class="logo-title"><div class="title"><img src="/images/logo@2x.png" style="width:127px;"><h3 title=""><a href="/">younguna</a></h3></div></div><ul class="social-links"></ul><div class="footer"><a target="_blank" href="/"><span>Theme by </span></a><a href="https://www.caicai.me"> CaiCai </a><span>&</span><a href="https://github.com/Ben02/hexo-theme-Anatole"> Ben</a><div class="by_farbox"><a href="https://hexo.io/zh-cn/" target="_blank">Proudly published with Hexo&#65281;</a></div></div></div><div class="main"><div class="page-top animated fadeInDown"><div class="nav"><li><a href="/">Home</a></li><li><a href="/archives">Archive</a></li></div><div class="information"><div class="back_btn"><li><a class="fa fa-chevron-left" onclick="window.history.go(-1)"> </a></li></div></div></div><div class="autopagerize_page_element"><div class="content"><div class="post-page"><div class="post animated fadeInDown"><div class="post-title"><h3><a>브라우저 뒤에서 일어나는 일</a></h3></div><div class="post-content"><hr>

<h1 id="&#xBE0C;&#xB77C;&#xC6B0;&#xC800;-&#xB4A4;&#xC5D0;&#xC11C;-&#xC77C;&#xC5B4;&#xB098;&#xB294;-&#xC77C;"><a href="#&#xBE0C;&#xB77C;&#xC6B0;&#xC800;-&#xB4A4;&#xC5D0;&#xC11C;-&#xC77C;&#xC5B4;&#xB098;&#xB294;-&#xC77C;" class="headerlink" title="&#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xB4A4;&#xC5D0;&#xC11C; &#xC77C;&#xC5B4;&#xB098;&#xB294; &#xC77C;"></a>&#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xB4A4;&#xC5D0;&#xC11C; &#xC77C;&#xC5B4;&#xB098;&#xB294; &#xC77C;</h1><hr>

<h3 id="&#xBE0C;&#xB77C;&#xC6B0;&#xC800;"><a href="#&#xBE0C;&#xB77C;&#xC6B0;&#xC800;" class="headerlink" title="&#xBE0C;&#xB77C;&#xC6B0;&#xC800;"></a>&#xBE0C;&#xB77C;&#xC6B0;&#xC800;</h3><ol class="ui list">
<li>URL&#xC5D0; &#xC785;&#xB825;&#xB41C; &#xAC12;&#xC744; &#xBE0C;&#xB77C;&#xC6B0;&#xC800; &#xB0B4;&#xBD80;&#xC5D0;&#xC11C; &#xACB0;&#xC815;&#xB41C; &#xADDC;&#xCE59;&#xC5D0; &#xB530;&#xB77C; &#xADF8; &#xC758;&#xBBF8;&#xB97C; &#xC870;&#xC0AC;&#xD55C;&#xB2E4;.</li>
<li>&#xC870;&#xC0AC;&#xB41C; &#xC758;&#xBBF8;&#xC5D0; &#xB530;&#xB77C; HTTP Request &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xB9CC;&#xB4E0;&#xB2E4;.</li>
<li>&#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xC6F9; &#xC11C;&#xBC84;&#xB85C; &#xC804;&#xC1A1;&#xD55C;&#xB2E4;.</li>
</ol>
<ul class="ui list">
<li>&#xC774;&#xB54C; &#xB9CC;&#xB4E4;&#xC5B4;&#xC9C4; &#xBA54;&#xC138;&#xC9C0; &#xC804;&#xC1A1;&#xC740; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xAC00; &#xC9C1;&#xC811;&#xD558;&#xB294; &#xAC83;&#xC774; &#xC544;&#xB2C8;&#xBA70; OS&#xC5D0; &#xC758;&#xB8B0;&#xD558;&#xC5EC; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xC804;&#xB2EC;&#xD55C;&#xB2E4;.</li>
<li>OS&#xC5D0; &#xC1A1;&#xC2E0;&#xC744; &#xC758;&#xB85C;&#xD560; &#xB54C;&#xB294; &#xB3C4;&#xBA54;&#xC778; &#xBA85;&#xC774; &#xC544;&#xB2C8;&#xB77C; IP&#xC8FC;&#xC18C;&#xB85C; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBC1B;&#xC744; &#xC0C1;&#xB300;&#xB97C; &#xC9C0;&#xC815;&#xD574;&#xC57C; &#xD558;&#xB294;&#xB370; &#xC774; &#xACFC;&#xC815;&#xC5D0;&#xC11C; DNS(Domain Name Service)&#xC5D0; &#xC870;&#xD68C;&#xD55C;&#xB2E4;.</li>
</ul>
<h3 id="&#xD504;&#xB85C;&#xD1A0;&#xCF5C;-&#xC2A4;&#xD0DD;-LAN-&#xC5B4;&#xB311;&#xD130;"><a href="#&#xD504;&#xB85C;&#xD1A0;&#xCF5C;-&#xC2A4;&#xD0DD;-LAN-&#xC5B4;&#xB311;&#xD130;" class="headerlink" title="&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;, LAN &#xC5B4;&#xB311;&#xD130;"></a>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;, LAN &#xC5B4;&#xB311;&#xD130;</h3><ol class="ui list">
<li>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;(OS&#xC5D0; &#xB0B4;&#xC7A5;&#xB41C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC81C;&#xC5B4;&#xC6A9; &#xC2A4;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4;)&#xC774; &#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBC1B;&#xB294;&#xB2E4;.</li>
<li>&#xBE0C;&#xB77C;&#xC6B0;&#xC800;&#xB85C;&#xBD80;&#xD130; &#xBC1B;&#xC740; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xD328;&#xD0B7; &#xC18D;&#xC5D0; &#xC800;&#xC7A5;&#xD55C;&#xB2E4;.</li>
<li>&#xC218;&#xC2E0;&#xCC98; &#xC8FC;&#xC18C; &#xB4F1;&#xC758; &#xC81C;&#xC5B4;&#xC815;&#xBCF4;&#xB97C; &#xB367;&#xBD99;&#xC778;&#xB2E4;.</li>
<li>&#xD328;&#xD0B7;&#xC744; LAN &#xC5B4;&#xB311;&#xD130;&#xC5D0; &#xB118;&#xAE34;&#xB2E4;.</li>
<li>LAN &#xC5B4;&#xB311;&#xD130;&#xB294; &#xD328;&#xD0B7;&#xC744; &#xBB3C;&#xB9AC;&#xC801; &#xC804;&#xAE30;&#xC801; &#xC2E0;&#xD638;&#xB85C; &#xBCC0;&#xD658;&#xC2DC;&#xD0A8;&#xB2E4;.</li>
<li>&#xC2E0;&#xD638;&#xB97C; LAN &#xCF00;&#xC774;&#xBE14;&#xC5D0; &#xC1A1;&#xCD9C;&#xC2DC;&#xD0A8;&#xB2E4;.</li>
</ol>
<ul class="ui list">
<li>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;&#xC740; &#xACC4;&#xCE35;&#xD654;&#xB41C; &#xAD6C;&#xC870;&#xB85C; &#xBAA8;&#xC5EC;&#xC788;&#xB294; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xC9D1;&#xD569;&#xC744; &#xC758;&#xBBF8;&#xD569;&#xB2C8;&#xB2E4;. &#xACC4;&#xCE35;&#xC744; &#xB098;&#xB204;&#xB294; &#xBAA9;&#xC801;&#xC740; &#xB9E4;&#xC6B0; &#xBCF5;&#xC7A1;&#xD55C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xBD84;&#xB2F4;&#xD558;&#xAE30; &#xC704;&#xD574;&#xC11C;&#xC785;&#xB2C8;&#xB2E4;. &#xD55C; &#xACC4;&#xCE35;&#xC5D0; &#xC18D;&#xD558;&#xB294; &#xD558;&#xB098;&#xC758; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xC774; &#xC778;&#xC811;&#xD55C; &#xACC4;&#xCE35;&#xC758; &#xB2E4;&#xB978; &#xD504;&#xB85C;&#xD1A0;&#xCF5C;&#xACFC; &#xD1B5;&#xC2E0;&#xC744; &#xD569;&#xB2C8;&#xB2E4;.</li>
<li>&#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;&#xC740; &#xD1B5;&#xC2E0; &#xC911; &#xC624;&#xB958;&#xAC00; &#xBC1C;&#xC0DD;&#xD558;&#xBA74; &#xC774; &#xC81C;&#xC5B4; &#xC815;&#xBCF4;&#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xC5EC; &#xACE0;&#xCCD0;&#xC11C; &#xC804;&#xC1A1;&#xD558;&#xAC70;&#xB098; &#xAC01;&#xC885; &#xC0C1;&#xD669;&#xC744; &#xC870;&#xC808;&#xD558;&#xB294; &#xB4F1; &#xB2E4;&#xC591;&#xD55C; &#xC5ED;&#xD560;&#xC744; &#xC218;&#xD589;&#xD55C;&#xB2E4;.</li>
</ul>
<h3 id="&#xD5C8;&#xBE0C;-&#xC2A4;&#xC704;&#xCE58;-&#xB77C;&#xC6B0;&#xD130;"><a href="#&#xD5C8;&#xBE0C;-&#xC2A4;&#xC704;&#xCE58;-&#xB77C;&#xC6B0;&#xD130;" class="headerlink" title="&#xD5C8;&#xBE0C;, &#xC2A4;&#xC704;&#xCE58;, &#xB77C;&#xC6B0;&#xD130;"></a>&#xD5C8;&#xBE0C;, &#xC2A4;&#xC704;&#xCE58;, &#xB77C;&#xC6B0;&#xD130;</h3><ol class="ui list">
<li>LAN &#xC5B4;&#xB311;&#xD130;&#xAC00; &#xC1A1;&#xC2E0;&#xD55C; &#xD328;&#xD0B7;&#xC740; &#xC2A4;&#xC704;&#xCE6D; &#xD5C8;&#xBE0C;&#xB97C; &#xACBD;&#xC720;&#xD558;&#xC5EC; &#xC778;&#xD130;&#xB137; &#xC811;&#xC18D;&#xC6A9; &#xB77C;&#xC6B0;&#xD130;&#xC5D0; &#xB3C4;&#xCC29;&#xD55C;&#xB2E4;.</li>
<li>&#xB77C;&#xC6B0;&#xD130;&#xB294; &#xD328;&#xD0B7;&#xC744; &#xC11C;&#xBE44;&#xC2A4; &#xD504;&#xB85C;&#xBC14;&#xC774;&#xB354;(&#xD1B5;&#xC2E0;&#xC0AC;)&#xC5D0;&#xAC8C; &#xC804;&#xB2EC;&#xD55C;&#xB2E4;.</li>
<li>&#xD328;&#xD0B7;&#xC740; &#xC778;&#xD130;&#xB137;&#xC73C;&#xB85C; &#xC9C4;&#xC785;&#xD558;&#xAC8C; &#xB41C;&#xB2E4;.</li>
</ol>
<ul class="ui list">
<li>&#xD5C8;&#xBE0C;&#xB294; &#xB9AC;&#xD53C;&#xD130;&#xC640; &#xAC19;&#xC774; &#xC804;&#xAE30;&#xC801;&#xC778; &#xC2E0;&#xD638;&#xB97C; &#xC99D;&#xD3ED;&#xC2DC;&#xCF1C; LAN&#xC758; &#xC804;&#xC1A1;&#xAC70;&#xB9AC;&#xB97C; &#xC5F0;&#xC7A5;&#xC2DC;&#xD0A4;&#xACE0; &#xC5EC;&#xB7EC;&#xB300;&#xC758; &#xC7A5;&#xBE44;(&#xCEF4;&#xD4E8;&#xD130;)&#xB97C; &#xC5F0;&#xACB0;&#xD574; LAN&#xC5D0; &#xC811;&#xC18D;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</li>
<li>&#xB9AC;&#xD53C;&#xD130;&#xB294; &#xB2E8;&#xC21C;&#xD788; &#xC804;&#xAE30;&#xC801;&#xC778; &#xC2E0;&#xD638;&#xB9CC; &#xC99D;&#xD3ED;&#xC2DC;&#xD0A4;&#xB294; &#xC5ED;&#xD560;&#xC744; &#xD55C;&#xB2E4;. UTP&#xCF00;&#xC774;&#xBE14;&#xC758; &#xCD5C;&#xB300; &#xC804;&#xC1A1;&#xAC70;&#xB9AC;&#xAC00; 100m&#xC774;&#xAE30; &#xB54C;&#xBB38;&#xC5D0; &#xB9AC;&#xD53C;&#xD130;&#xB97C; &#xC774;&#xC6A9;&#xD558;&#xC5EC; &#xC2E0;&#xD638;&#xB97C; &#xC99D;&#xD3ED;&#xC2DC;&#xD0AC; &#xC218; &#xC788;&#xB2E4;.</li>
<li>&#xC2A4;&#xC704;&#xCE58;&#xB294; &#xC5F0;&#xACB0;&#xB418;&#xC5B4; &#xC788;&#xB294; &#xBAA8;&#xB4E0; &#xC7A5;&#xBE44;&#xC758; IP&#xC640; MAC&#xC8FC;&#xC18C;&#xB97C; &#xD14C;&#xC774;&#xBE14;&#xB85C; &#xC720;&#xC9C0;&#xD558;&#xACE0; &#xC788;&#xB2E4;. &#xD504;&#xB808;&#xC784;&#xC774; &#xC790;&#xC2E0;&#xC5D0;&#xAC8C; &#xC218;&#xC2E0;&#xB418;&#xBA74; &#xADF8;&#xAC83;&#xC758; &#xBAA9;&#xC801;&#xC9C0;&#xB97C; &#xD30C;&#xC545;&#xD558;&#xC5EC; &#xADF8; &#xB514;&#xBC14;&#xC774;&#xC2A4;&#xC5D0;&#xAC8C; &#xD504;&#xB808;&#xC784;&#xC744; &#xBCF4;&#xB0B4;&#xC900;&#xB2E4;. </li>
<li>&#xB77C;&#xC6B0;&#xD130;&#xB294; &#xB458; &#xD639;&#xC740; &#xADF8; &#xC774;&#xC0C1;&#xC758; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xAC04; &#xB370;&#xC774;&#xD130; &#xC804;&#xC1A1;&#xC744; &#xC704;&#xD574; &#xCD5C;&#xC801; &#xACBD;&#xB85C;&#xB97C; &#xC124;&#xC815;&#xD574; &#xC8FC;&#xBA70; &#xB370;&#xC774;&#xD130;&#xB97C; &#xD574;&#xB2F9; &#xACBD;&#xB85C;&#xB97C; &#xB530;&#xB77C; &#xD55C; &#xD1B5;&#xC2E0;&#xB9DD;&#xC5D0;&#xC11C; &#xB2E4;&#xB978; &#xD1B5;&#xC2E0;&#xB9DD;&#xC73C;&#xB85C; &#xD1B5;&#xC2E0;&#xD560; &#xC218; &#xC788;&#xB3C4;&#xB85D; &#xB3C4;&#xC640;&#xC8FC;&#xB294; &#xC778;&#xD130;&#xB137; &#xC811;&#xC18D; &#xC7A5;&#xBE44;&#xC774;&#xB2E4;.</li>
<li>ISP(Internet Service Provider)&#xC5C5;&#xCCB4;&#xC5D0;&#xC11C; &#xC81C;&#xACF5;&#xD558;&#xB294; &#xD55C; &#xAC1C;&#xC758; &#xC778;&#xD130;&#xB137; IP Address&#xB85C; &#xC5EC;&#xB7EC;&#xB300;&#xC758; &#xC7A5;&#xBE44;&#xB4E4;&#xC774; &#xC778;&#xD130;&#xB137;&#xC744; &#xACF5;&#xC720;&#xD560; &#xC218; &#xC788;&#xB294; &#xAE30;&#xB2A5;&#xC744; &#xC81C;&#xACF5;&#xD569;&#xB2C8;&#xB2E4;. &#xC8FC;&#xB85C; &#xC0AC;&#xB78C;&#xB4E4;&#xC774; &#xACF5;&#xC720;&#xAE30;&#xB97C; &#xC774;&#xC57C;&#xAE30;&#xD560;&#xB54C;&#xB294; &#xAC00;&#xC815;&#xC5D0;&#xC11C; &#xC0AC;&#xC6A9;&#xD558;&#xB294; &#xC18C;&#xC6A9;&#xB7C9; &#xB77C;&#xC6B0;&#xD130;&#xB97C; &#xC758;&#xBBF8;&#xD558;&#xBA70; ISP&#xC5D0;&#xC11C; &#xD560;&#xB2F9;&#xBC1B;&#xC740; &#xD558;&#xB098;&#xC758; &#xACF5;&#xC778; IP&#xB97C; &#xB0B4;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC5D0;&#xC11C; &#xC5EC;&#xB7EC;&#xAC1C;&#xC758; IP &#xC8FC;&#xC18C;&#xB85C; &#xBCC0;&#xD658; &#xC0AC;&#xC6A9;&#xAC00;&#xB2A5;&#xD558;&#xAE30;  &#xB54C;&#xBB38;&#xC5D0; &#xD55C; &#xB300;&#xC758; &#xC7A5;&#xBE44;&#xC5D0;&#xC11C;&#xB9CC; &#xC778;&#xD130;&#xB137; &#xC811;&#xC18D;&#xC774;&#xB098; &#xC678;&#xBD80; &#xB124;&#xD2B8;&#xC6CC;&#xD06C;&#xC640; &#xC5F0;&#xACB0;&#xB418;&#xB294; &#xAC83;&#xC744; 253&#xB300;&#xAE4C;&#xC9C0; &#xB3D9;&#xC2DC;&#xC5D0; &#xC778;&#xD130;&#xB137;&#xC744; &#xC811;&#xC18D;&#xD560; &#xC218; &#xC788;&#xB2E4;.</li>
</ul>
<h3 id="&#xC561;&#xC138;&#xC2A4;-&#xD68C;&#xC120;-ISP-Internet-Service-Provider"><a href="#&#xC561;&#xC138;&#xC2A4;-&#xD68C;&#xC120;-ISP-Internet-Service-Provider" class="headerlink" title="&#xC561;&#xC138;&#xC2A4; &#xD68C;&#xC120;, ISP(Internet Service Provider)"></a>&#xC561;&#xC138;&#xC2A4; &#xD68C;&#xC120;, ISP(Internet Service Provider)</h3><ol class="ui list">
<li>&#xD328;&#xD0B7;&#xC740; &#xC778;&#xD130;&#xB137;&#xC758; &#xC785;&#xAD6C;&#xC5D0; &#xC788;&#xB294; &#xC5D1;&#xC138;&#xC2A4; &#xD68C;&#xC120;(&#xD1B5;&#xC2E0;&#xD68C;&#xC120;)&#xC5D0; &#xC758;&#xD574; POP(Point of presence, &#xD1B5;&#xC2E0;&#xC0AC;&#xC6A9; &#xB77C;&#xC6B0;&#xD130;)&#xAE4C;&#xC9C0; &#xC6B4;&#xBC18;&#xB41C;&#xB2E4;.</li>
<li>POP&#xB97C; &#xAC70;&#xCCD0; &#xC778;&#xD130;&#xB137;&#xC758; &#xD575;&#xC2EC;&#xBD80;&#xB85C; &#xB4E4;&#xC5B4;&#xAC00;&#xAC8C; &#xB41C;&#xB2E4;.</li>
<li>&#xC218; &#xB9CE;&#xC740; &#xACE0;&#xC18D; &#xB77C;&#xC6B0;&#xD130;&#xB4E4; &#xC0AC;&#xC774;&#xB85C; &#xD328;&#xD0B7;&#xC774; &#xBAA9;&#xC801;&#xC9C0;&#xB97C; &#xD5A5;&#xD574; &#xC804;&#xC1A1;&#xB41C;&#xB2E4;.</li>
</ol>
<h3 id="&#xBC29;&#xD654;&#xBCBD;-&#xCE90;&#xC2DC;&#xC11C;&#xBC84;"><a href="#&#xBC29;&#xD654;&#xBCBD;-&#xCE90;&#xC2DC;&#xC11C;&#xBC84;" class="headerlink" title="&#xBC29;&#xD654;&#xBCBD;, &#xCE90;&#xC2DC;&#xC11C;&#xBC84;"></a>&#xBC29;&#xD654;&#xBCBD;, &#xCE90;&#xC2DC;&#xC11C;&#xBC84;</h3><ol class="ui list">
<li>&#xD328;&#xD0B7;&#xC740; &#xC778;&#xD130;&#xB137; &#xD575;&#xC2EC;&#xBD80;&#xB97C; &#xD1B5;&#xACFC;&#xD558;&#xC5EC; &#xC6F9; &#xC11C;&#xBC84;&#xCE21;&#xC758; LAN&#xC5D0; &#xB3C4;&#xCC29;&#xD55C;&#xB2E4;.</li>
<li>LAN&#xC758; &#xBC29;&#xD654;&#xBCBD;&#xC740; &#xD328;&#xD0B7;&#xC744; &#xAC80;&#xC0AC;&#xD55C;&#xB2E4;.</li>
<li>&#xCE90;&#xC2DC;&#xC11C;&#xBC84;&#xAC00; &#xD328;&#xD0B7;&#xC774; &#xC6F9; &#xC11C;&#xBC84;&#xAE4C;&#xC9C0; &#xAC00;&#xC57C;&#xD558;&#xB294;&#xC9C0; &#xAC00;&#xC9C0; &#xC54A;&#xC544;&#xB3C4; &#xB418;&#xB294;&#xC9C0;&#xB97C; &#xD310;&#xB2E8;&#xD55C;&#xB2E4;.</li>
</ol>
<ul class="ui list">
<li>&#xD328;&#xD0B7;&#xC774; &#xC694;&#xAD6C;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xCE90;&#xC2DC;&#xC11C;&#xBC84;&#xC5D0; &#xC788;&#xB2E4;&#xBA74; &#xC6F9; &#xC11C;&#xBC84;&#xC5D0; &#xAC00;&#xC9C0; &#xC54A;&#xACE0; &#xBC14;&#xB85C; &#xADF8; &#xAC12;&#xC744; &#xC751;&#xB2F5;&#xD574;&#xC900;&#xB2E4;.</li>
<li>&#xC6F9; &#xC11C;&#xBC84;&#xC5D0;&#xC11C; &#xC751;&#xB2F5;&#xD558;&#xB294; &#xB370;&#xC774;&#xD130;&#xAC00; &#xB2E4;&#xB978; &#xC694;&#xCCAD;&#xC5D0; &#xC774;&#xC6A9;&#xB420; &#xC218; &#xC788;&#xB2E4;&#xBA74; &#xADF8; &#xB370;&#xC774;&#xD130;&#xB3C4; &#xCE90;&#xC2DC;&#xC11C;&#xBC84;&#xC5D0; &#xC800;&#xC7A5;&#xB41C;&#xB2E4;.</li>
</ul>
<h3 id="&#xC6F9;-&#xC11C;&#xBC84;"><a href="#&#xC6F9;-&#xC11C;&#xBC84;" class="headerlink" title="&#xC6F9; &#xC11C;&#xBC84;"></a>&#xC6F9; &#xC11C;&#xBC84;</h3><ol class="ui list">
<li>&#xD328;&#xD0B7;&#xC774; &#xBB3C;&#xB9AC;&#xC801;&#xC778; &#xC6F9; &#xC11C;&#xBC84;&#xC5D0; &#xB3C4;&#xCC29;&#xD558;&#xBA74; &#xC6F9; &#xC11C;&#xBC84;&#xC758; &#xD504;&#xB85C;&#xD1A0;&#xCF5C; &#xC2A4;&#xD0DD;&#xC740; &#xD328;&#xD0B7;&#xC744; &#xCD94;&#xCD9C;&#xD558;&#xC5EC; &#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBCF5;&#xC6D0;&#xD558;&#xACE0; &#xC6F9; &#xC11C;&#xBC84; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC5D0; &#xB118;&#xAE34;&#xB2E4;.</li>
<li>&#xBA54;&#xC138;&#xC9C0;&#xB97C; &#xBC1B;&#xC740; &#xC6F9; &#xC11C;&#xBC84;&#xB294; &#xC560;&#xD50C;&#xB9AC;&#xCF00;&#xC774;&#xC158;&#xC740; &#xC694;&#xCCAD; &#xBA54;&#xC138;&#xC9C0;&#xC5D0; &#xB530;&#xB978; &#xB370;&#xC774;&#xD130;&#xB97C; &#xC751;&#xB2F5; &#xBA54;&#xC138;&#xC9C0;&#xC5D0; &#xB123;&#xC5B4; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xB85C; &#xC1A1;&#xC2E0;&#xD55C;&#xB2E4;.</li>
<li>&#xC804;&#xB2EC;&#xB41C; &#xC21C;&#xC11C;&#xC758; &#xC5ED;&#xC21C;&#xC73C;&#xB85C; &#xC751;&#xB2F5; &#xBA54;&#xC138;&#xC9C0;&#xAC00; &#xD074;&#xB77C;&#xC774;&#xC5B8;&#xD2B8;&#xC5D0;&#xAC8C; &#xC804;&#xB2EC;&#xB41C;&#xB2E4;.</li>
</ol>
</div><div class="post-footer"><div class="meta"><div class="info"><i class="fa fa-sun-o"></i><span class="date">2019-07-04</span><i class="fa fa-tag"></i><a class="tag" href="/tags/네트워크/" title="네트워크">네트워크 </a><a class="tag" href="/tags/Network/" title="Network">Network </a><a class="tag" href="/tags/브라우저/" title="브라우저">브라우저 </a></div></div></div></div><div class="pagination"><ul class="clearfix"><li class="pre pagbuttons"><a class="btn" role="navigation" href="/2019/07/18/git-basics/" title="git basics">Previous Post</a></li><li class="next pagbuttons"><a class="btn" role="navigation" href="/2019/07/03/ubuntu-파일명으로-검색/" title="ubuntu 파일명으로 검색">Next Post</a></li></ul></div></div></div></div></div><script src="/js/jquery.js"></script><script src="/js/jquery-migrate-1.2.1.min.js"></script><script src="/js/jquery.appear.js"></script></body></html>